---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceAllPoints
source: html/3c97307b-b9ec-a24d-4e68-3685b93aff43.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedSurfaceAllPoints Property

"Show all points"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedSurfaceAllPoints { get; }
```